{
  "id": "c0fe67d423dc6930",
  "slug": "atlassian-mcp-server",
  "name": "Atlassian Mcp Server",
  "description": "Remote MCP Server that securely connects Jira and Confluence with your LLM, IDE, or agent platform of choice.",
  "author": "atlassian",
  "authorAvatar": "https://avatars.githubusercontent.com/u/168166?v=4",
  "repoUrl": "https://github.com/atlassian/atlassian-mcp-server",
  "repoFullName": "atlassian/atlassian-mcp-server",
  "stars": 131,
  "forks": 14,
  "category": "ai-ml",
  "categories": [
    "ai-ml"
  ],
  "tags": [],
  "tier": 1,
  "status": "active",
  "createdAt": "2025-08-01T22:31:35Z",
  "updatedAt": "2025-12-15T03:04:19Z",
  "lastCommitAt": "2025-12-12T20:00:12Z",
  "source": "github-search",
  "collectedAt": "2025-12-15T03:53:48.158Z",
  "authorUrl": "https://github.com/atlassian",
  "license": "Apache-2.0",
  "readme": "<p align=\"center\">\n  <img src=\"images/atlassian_logo_brand_RGB.svg\">\n</p>\n\n>[!NOTE]\n> This feature is currently in public beta, which means: \n> - Core functionality is available, but some advanced features are still under development.\n> - The experience may vary across different clients—Claude, for instance, works best on the Team or Enterprise plan.\n> - We’re actively gathering feedback to improve the product before its general availability (GA) release.  \n> \n> For more information, read our blog post - [Introducing Atlassian's Remote Model Context Protocol (MCP) Server - Work Life by Atlassian](https://www.atlassian.com/blog/announcements/remote-mcp-server)\n\n# Atlassian MCP Server\nThe Model Context Protocol (MCP) is a new, standardized protocol designed by Anthropic to manage context between large language models (LLMs) and external systems. This repository offers an MCP Server for Atlassian.\n\nThe Remote MCP Server is a cloud-based bridge between your Atlassian Cloud site and compatible external tools. Once configured, it enables those tools to interact with Jira and Confluence data in real-time. This functionality is powered by secure **OAuth 2.1 authorization**, which ensures all actions respect the user’s existing access controls.\n\nThe Remote MCP Server helps bring Atlassian data into your existing workflows:\n- **Summarize and search** Jira and Confluence content without switching tools.\n- **Create and update** issues or pages based on natural language commands.\n- **Bulk process tasks** like generating tickets from meeting notes or specs.\nIt’s designed to support developers, content creators, and project managers working within IDEs or AI platforms.\n\n## Before you start\nEnsure your environment meets the necessary requirements to successfully set up the Remote MCP Server. This section outlines the technical prerequisites, access considerations, and security details.\n\n### Prerequisites\nBefore connecting to the Remote MCP Server, review the setup requirements for your environment:\n\n#### Cloud-based Setup\n- An Atlassian Cloud site with Jira and/or Confluence\n- Access to an AI Client (Claude for Teams for example)\n- A modern browser to complete the OAuth 2.0 authorization flow\n\n#### Desktop Setup for Local Clients\n- An Atlassian Cloud site with Jira and/or Confluence\n- A supported IDE (for example, Claude desktop, VS Code, or Cursor) or a custom MCP-compatible client\n- Node.js v18+ installed to run the local MCP proxy (mcp-remote). Download from [nodejs.org](https://nodejs.org/en)\n- A modern browser for completing the OAuth login\n\n### Beta access and limits\nThe beta is open to all Atlassian Cloud customers. No special sign-up is required. However, usage is subject to rate limits:\n- **Standard plan**: Moderate usage thresholds.\n- **Premium/Enterprise plans**: Higher usage quotas (1,000 requests/hour plus per-user limits).\n\n### Data and security\nSecurity is a core focus of the Remote MCP Server:\n1. All traffic is encrypted via HTTPS using TLS 1.2 or later.\n2. OAuth 2.0 ensures secure authentication and access control.\n3. Data access respects Jira and Confluence user permissions.\n\n## How It Works\n### Architecture and Communication\n1. A supported client connects to the server endpoint:\n```\nhttps://mcp.atlassian.com/v1/sse\n```\n2. A secure browser-based OAuth 2.0 flow is triggered.\n3. Once authorized, the client streams contextual data and receives real-time responses from Jira or Confluence.\n\n### Permission Management\nAccess is granted only to data that the user already has permission to view in Atlassian Cloud. All actions respect existing project or space-level roles. OAuth tokens are scoped and session-based.\nOnce connected, you can perform a variety of useful tasks from within your supported client.\n\n### Example Workflows\n#### Jira workflows\nUse these examples to understand how to interact with Jira:\n\n- **Search**: “Find all open bugs in Project Alpha.”\n- **Create/update**: “Create a story titled ‘Redesign onboarding’.”\n- **Bulk create**: “Make five Jira issues from these notes.”\n\n#### Confluence workflows\nAccess and manage documentation content directly:\n\n- **Summarize**: “Summarize the Q2 planning page.”\n- **Create**: “Create a page titled ‘Team Goals Q3’.”\n- **Navigate**: “What spaces do I have access to?”\n\n#### Combined Tasks\nIntegrate actions across Jira and Confluence:\n\n- **Link content**: “Link these three Jira tickets to the ‘Release Plan’ page.”\n\n>[!Note]\n> Actual capabilities vary depending on your permission level and client platform.\n\n### Managing access\nIf you're an admin preparing your team to use the Remote MCP Server, keep the following considerations in mind:\n- Ensure users have product access to Jira and/or Confluence via Atlassian Admin.\n- Authorization tokens are tied to the user’s current product permissions—check these if data isn’t accessible.\n- App authorizations can be revoked by end users through their profile settings or by admins in the [Connect apps section of Atlassian Admin](https://support.atlassian.com/security-and-access-policies/docs/manage-your-users-third-party-apps/) for site-level control.\n- Consider establishing usage guidelines or policies for teams leveraging AI-driven content generation.\n- Reach out to your Atlassian account representative for advice on OAuth scope control and long-term support planning.\n\n## Setting up Atlassian MCP Server\n### Cloud-based Clients\nDepending on the tool you're using, the setup process may vary. We recommend you navigate to the exact instructions for connecting to an MCP client through the tool's documentation. Here is an example for [setting up Claude.ai](https://support.atlassian.com/rovo/docs/setting-up-claude-ai/)\n\n### Desktop/Local Clients\n>[!NOTE]\n> If you’re using VSCode, you can also install it directly by browsing their [curated list of MCP servers](https://code.visualstudio.com/mcp).\n\n1. Open your terminal\n2. Run the following command to start the proxy and begin authentication:\n```bash\nnpx -y mcp-remote https://mcp.atlassian.com/v1/sse\n```\n>[!NOTE]\n> If this command doesn't work due to a version-related issue, try specifying an older version of mcp-remote. The example below uses version 0.1.13, but you may use another version if needed:\n```bash\nnpx -y mcp-remote@0.1.13 https://mcp.atlassian.com/v1/sse\n```\n3. A browser window will open. Log in using your Atlassian credentials and approve the required permissions.\n4. Once authorized, return to your IDE and configure the MCP server settings by adding the following atlassian entry to the server configuration file (e.g. `mcp.json`, `mcp_config.json`):\n```json\n\"mcp.servers\": {\n  \"atlassian\": {\n    \"command\": \"npx\",\n    \"args\": [\"-y\", \"mcp-remote\", \"https://mcp.atlassian.com/v1/sse\"]\n  }\n}\n```\n4. Save and reload your client's MCP extension or plugin.\n\n## Support and feedback\nYour feedback plays a crucial role in shaping the Remote MCP Server. If you encounter bugs, limitations, or have suggestions:\n- Visit the [Atlassian Support Portal](https://support.atlassian.com/) to report issues.\n- Share your experiences and feature requests on the [Atlassian Community](https://community.atlassian.com/).\n- Enterprise customers can contact their Atlassian Customer Success Manager for advanced support and roadmap discussions.\n- We’re excited to collaborate with you to improve this capability before its general availability.\n\n## Guides\n- [Introducing Atlassian's MCP server](https://www.atlassian.com/blog/announcements/remote-mcp-server)\n- [Setting up Claude.ai](https://support.atlassian.com/rovo/docs/setting-up-claude-ai/)\n- [Setting up IDEs (like VS Code or Cursor)](https://support.atlassian.com/rovo/docs/setting-up-ides/)\n- [Understanding Authentication & OAuth](https://support.atlassian.com/rovo/docs/authentication-and-authorization/)\n- [Troubleshooting and verifying your setup](https://support.atlassian.com/rovo/docs/troubleshooting-and-verifying-your-setup/)\n\n",
  "installCommand": "git clone https://github.com/atlassian/atlassian-mcp-server ~/.claude/skills/atlassian-mcp-server",
  "defaultBranch": "main",
  "hasMarketplaceJson": false,
  "skillPath": "README.md"
}