{
  "id": "c9b682c78e4f8f52",
  "slug": "documentation",
  "name": "Documentation",
  "description": "The documentation content home for https://quantum.cloud.ibm.com/docs",
  "author": "Qiskit",
  "authorAvatar": "https://avatars.githubusercontent.com/u/30696987?v=4",
  "repoUrl": "https://github.com/Qiskit/documentation",
  "repoFullName": "Qiskit/documentation",
  "stars": 73,
  "forks": 156,
  "category": "writing",
  "categories": [
    "writing"
  ],
  "tags": [],
  "tier": 2,
  "status": "active",
  "createdAt": "2023-09-06T18:07:38Z",
  "updatedAt": "2025-12-19T19:28:54Z",
  "lastCommitAt": "2025-12-20T00:28:21Z",
  "source": "github-search",
  "collectedAt": "2025-12-21T03:47:28.967Z",
  "authorUrl": "https://github.com/Qiskit",
  "license": "NOASSERTION",
  "readme": "# Qiskit documentation\n\nThe documentation content home for https://quantum.cloud.ibm.com/docs and https://docs.quantum.ibm.com (excluding API reference).\n\nRefer to:\n\n- Our [MDX guide](./mdx-guide.md) for how to write documentation and use our variant of markdown.\n- Our [style guide](./style-guide.md) for technical writing guidance.\n\n### Licensing\n\nThis repository is dual-licensed to distinguish between code and content.\n\n- Code (including scripts, source files, and code snippets in documentation examples) is licensed under the Apache License 2.0, please review the `LICENSE` file for more information\n- Content (including guides, tutorials, courses, media, and other non-code assets) is licensed under the Creative Commons Attribution-ShareAlike 4.0 International (CC BY-SA 4.0), please review the `LICENSE-DOCS` file for more information.\n\n## Improving IBM Quantum and Qiskit documentation\n\nMaintaining up-to-date documentation is a huge challenge for any software project, but especially for a field like quantum computing, because advances in new research and technological capabilities come at a fast pace. As a result, we greatly appreciate anyone who takes the time to support us in keeping this content accurate and up to the highest quality standard possible, to benefit the broadest range of users.\n\nRead on for more information about how to support this project:\n\n### Best ways to contribute to documentation\n\n#### 1. Report bugs, inaccuracies, or general content issues\n\nThis is the quickest, easiest, and most helpful way to contribute to this project and improve the quality of Qiskit&reg; and IBM Quantum&reg; documentation. There are a few different ways to report issues, depending on where it was found:\n\n- For problems you've found in the [Qiskit SDK API Reference](https://docs.quantum.ibm.com/api/qiskit) section, open an issue in the Qiskit repo [here](https://github.com/Qiskit/qiskit/issues/new/choose).\n- For problems you've found in the [Qiskit Runtime client](https://docs.quantum.ibm.com/api/qiskit-ibm-runtime) section, open an issue in the Qiskit IBM Runtime repo [here](https://github.com/Qiskit/qiskit-ibm-runtime/issues/new/choose).\n- For problems you've found in any other section of [docs](https://docs.quantum.ibm.com), open a content bug issue [here](https://github.com/Qiskit/documentation/issues/new/choose).\n\n#### 2. Suggest new content\n\nIf you think there are gaps in our documentation, or sections that could be expanded upon, we invite you to open a [new content request issue](https://github.com/Qiskit/documentation/issues/new/choose).\n\nNot every new content suggestion is a good fit for docs, nor are we able to prioritize every request immediately. However, we will do our best to respond to content requests in a timely manner, and we greatly appreciate our community's efforts in generating new ideas.\n\nIf you are interested in writing the new content yourself, or already have some draft work you think could be integrated, please also mention that in the issue description. If your content suggestion is accepted, we will let you know and work with you to get the content written and reviewed.\n\nPlease note: we DO NOT accept unsolicited PRs for new pages or large updates to existing content. The content that we include in docs is carefully planned and curated by our content team and must go through the appropriate review process to ensure the quality is of the highest possible standard before deploying to production. As a result we are very selective with which content suggestions are approved, and it is unlikely that PRs submitted without an associated approved content request will be accepted.\n\n#### 3. Validate existing issues\n\nYou can help the team prioritize already-open issues by doing the following:\n\n- For bug reports, leave a comment in the issue if you have also been experiencing the same problem and can reproduce it (include as much information as you can, e.g., browser type, Qiskit version, etc.).\n- For new content requests, leave a comment or upvote (👍) in the issue if you also would like to see that new content added.\n\n#### 4. Fix an open issue\n\nYou can look through the open issues we have in this repo and address them with a PR. We recommend focusing on issues with the \"good first issue\" label.\n\nBefore getting started on an issue, remember to do the following:\n\n1. Read the [Code of Conduct](https://quantum.cloud.ibm.com/docs/guides/code-of-conduct)\n2. Check for open, unassigned issues with the \"good first issue\" label\n3. Select an issue that is not already assigned to someone and leave a comment to request to be assigned\n\nOnce you have an issue to work on, see the \"How to work with this repo\" section below to get going, then open a PR.\n\nBefore opening a PR, remember to do the following:\n\n1. Check that you have addressed all the requirements from the original issue\n2. Run the quality control checks with `npm run check`\n3. Use the GitHub \"fixes\" notation to [link your PR to the issue](https://docs.github.com/en/issues/tracking-your-work-with-issues/linking-a-pull-request-to-an-issue) you are addressing\n\n## Set up this repository\n\n### Git clone tip\n\nThis repository is very large, so it is slow to clone the first time. We recommend instead using the argument `--filter=blob:none`:\n\n```bash\ngit clone --filter=blob:none https://github.com/Qiskit/documentation.git\n```\n\n`--filter=blob:none` means that Git will _lazily_ download file contents when you need them, rather than eagerly downloading everything on the initial clone.\n\nWe also recommend running this command once to tell Git to ignore the `gh-pages` branch, which is solely used for PR previews and is very large:\n\n```bash\ngit config --add remote.origin.fetch '^refs/heads/gh-pages'\n```\n\n### Git email address\n\nTo contribute code to this repository, your email must be configured properly with Git, as follows:\n\n1. Run `git config --get user.email`. You do not need to make any further changes if the email address is one of the addresses set up with your github.com account.\n2. Otherwise, run `git config --global user.email <your-email>`. Use an email address associated with your github.com account.\n\n### Prerequisites to building the docs locally\n\nWe provide several tools to preview the documentation locally and to run quality checks. While many of these tools run in your PR through CI, we recommend installing them locally for faster iteration.\n\nFirst, install the below software:\n\n1. [Node.js](https://nodejs.org/en). If you expect to use JavaScript in other projects, consider using [NVM](https://github.com/nvm-sh/nvm). Otherwise, consider using [Homebrew](https://formulae.brew.sh/formula/node) or installing [Node.js directly](https://nodejs.org/en).\n2. [Docker](https://www.docker.com). You must also ensure that it is running.\n   - If you cannot use Docker from docker.com, consider using use [Colima](https://github.com/abiosoft/colima) or [Rancher Desktop](https://rancherdesktop.io). When installing Rancher Desktop, choose Moby/Dockerd as the engine, rather than nerdctl. To ensure it's running, open up the app \"Rancher Desktop\".\n3. [Tox](https://tox.wiki/) to run Python tools.\n   - We recommend using [pipx](https://pipx.pypa.io/stable/), which is a tool to install Python programs while keeping your Python installation clean. After installing pipx, use `pipx install tox`.\n\nThen, install the dependencies with:\n\n```bash\nnpm install\n```\n\n## Preview the docs locally\n\nYou can preview the docs locally by following these two steps:\n\n1. Ensure Docker is running. For example, open Rancher Desktop.\n2. Run `./start` in your terminal, and open http://localhost:3000 in your browser.\n   - On Windows, run `python start` instead. Alternatively, use Windows Subsystem for Linux and run `./start`.\n\nThe preview application does not include the top nav bar. Instead, navigate to the folder you want with the links in the home page. You can return to the home page at any time by clicking \"IBM Quantum Documentation Preview\" in the top-left of the header.\n\nMaintainers: when you release a new version of the image, you need to update the image digest in `./start` by following the instructions at the top of the file and opening a pull request.\n\n### Tip: Periodically prune Docker\n\nOccasionally, Docker might fail when it runs out of disk space. For example, you might encounter an error like this:\n\n```\nENOSPC: no space left on device, mkdir '/tmp/xfs-4d1dfe51'\n```\n\nTry running `docker system prune` to clear Docker's system space.\n\n### API docs authors: How to preview your changes\n\nAPI docs authors can preview their changes to one of the APIs by using the `-a` parameter to specify the path to the docs folder:\n\n1. Run `npm run gen-api -- -p <pkg-name> -v <version> -a <path/to/docs/_build/html>`.\n2. Execute `./start` and open up `http://localhost:3000`, as explained in the prior section.\n\n## Run quality checks\n\nWe use multiple tools to ensure that documentation meets high standards. These tools will run automatically in your PR through CI, but it is much faster to run the checks locally.\n\nUse `./fix` to automatically apply fixes, like fixing formatting. Warning: we cannot automatically fix every problem, so you should also run `./check` afterwards.\n\n```sh\n./fix\n```\n\nUse `./check` to validate that there are no issues. If you encounter an error, fix it by following the instructions in the error message, then keep running `./check` and fixing any errors until it fully passes without any error.\n\n```sh\n./check\n```\n\nOn Windows, run `python fix` and `python check` instead. Alternatively, use Windows Subsystem for Linux and run `./fix` and `./check`.\n\n### VSCode: optional extensions\n\nYou may find it convenient to install the following VSCode extensions to automatically run some of our tools. Setting up these extensions is optional.\n\n- For Jupyter notebooks, add the tool 'squeaky' as a [pre-save\n  hook](https://github.com/frankharkins/squeaky?tab=readme-ov-file#jupyter-pre-save-hook).\n  This will fix and lint your notebooks when you save them.\n- [Code Spell Checker](https://marketplace.visualstudio.com/items?itemName=streetsidesoftware.code-spell-checker)\n\n### Advanced: run additional checks\n\nWe offer some tools that are not included in `./check` and `./fix`. Likewise, many of the checks skip API docs by default.\n\nRun `npm run` to see a list of all our checks. For any particular check, run `npm run my-check -- --help` for more information and advanced arguments, such as `npm run check:markdown -- --help`.\n\n## Jupyter notebooks\n\n### Add a new notebook\n\nWhen adding a new notebook, you'll need to tell the testing tools how to handle it.\nTo do this, add the file path to `scripts/config/notebook-testing.toml`. There are\nfour categories:\n\n- `notebooks_normal_test`: Notebooks to be run normally in CI. These notebooks\n  can't submit jobs as the queue times are too long and it will waste\n  resources. You _can_ interact with IBM Quantum to retrieve jobs and backend\n  information.\n- `notebooks_that_submit_jobs`: Notebooks that submit jobs, but that are small\n  enough to run on a 5-qubit simulator. We will test these notebooks in CI by\n  patching `least_busy` to return a 5-qubit fake backend.\n- `notebooks_no_mock`: For notebooks that can't be tested using the 5-qubit\n  simulator patch. We skip testing these in CI and instead run them twice per\n  month. Any notebooks with cells that take more than five minutes to run are\n  also deemed too big for CI. Try to avoid adding notebooks to this category if\n  possible.\n- `notebooks_exclude`: Notebooks to be ignored.\n\nIf your notebook uses the latex circuit drawer (`qc.draw(\"latex\")`), you must\nalso add it to the \"Check for notebooks that require LaTeX\" step in\n`.github/workflows/notebook-test.yml`.\n\nIf you don't do this step, you will get the error \"FAILED scripts/nb-tester/test/test_notebook_classification.py::test_all_notebooks_are_classified\".\n\n### Add package version information\n\nAdd a new markdown cell under your title with a `version-info` tag.\nWhen you execute the notebook (see the next section), the script will populate\nthis cell with the package versions so users can reproduce the results.\n\n### Execute notebooks\n\nBefore submitting a new notebook or code changes to a notebook, you must run\nthe notebook using `tox -- --write <path-to-notebook>` and commit the results.\nIf the notebook submits jobs, also use the argument `--submit-jobs`. This means\nwe can be sure all notebooks work and that users will see the same results when\nthey run using the environment we recommend.\n\nTo execute notebooks in a fixed Python environment, first install `tox` using\n[pipx](https://pipx.pypa.io/stable/):\n\n```sh\npipx install tox\n```\n\nYou also need to install a few system dependencies: TeX, Poppler, and graphviz.\nOn macOS, you can run `brew install mactex-no-gui poppler graphviz`. On Ubuntu,\nyou can run `apt-get install texlive-pictures texlive-latex-extra poppler-utils\ngraphviz`.\n\n- To execute all notebooks, run tox.\n  ```sh\n  tox\n  ```\n- To only execute specific notebooks, pass them as arguments.\n  ```sh\n  tox -- <path/to/notebook.ipynb> <path/to/another-notebook.ipynb>\n  ```\n- To write the execution results to the file, pass the `--write` argument.\n  Since we only allow writing results from real hardware, you will usually also\n  need to pass `--test-strategy=hardware`. Note this means the run will use QPU\n  time.\n  ```sh\n  tox -- optional/paths/to/notebooks.ipynb --write --test-strategy=hardware\n  ```\n\nWhen you make a pull request changing a notebook that doesn't submit jobs, you\ncan get a version of that notebook that was executed by tox from CI. To do\nthis, click \"Show all checks\" in the info box at the bottom of the pull request\npage on GitHub, then choose \"Details\" for the \"Test notebooks\" job. From the\njob page, click \"Summary\", then download \"Executed notebooks\". Otherwise, if\nyour notebook does submit jobs, you need to run it locally using the steps\nmentioned earlier.\n\n### Ignore warnings in your notebook\n\nWe don't want users to see warnings that can be avoided, so it's best to fix\nthe code to avoid them. However, if a warning is unavoidable, you can stop it\nblocking CI by adding an `ignore-warnings` tag to the cell. In VSCode,\nright-click the cell, choose \"Add cell tag\", type `ignore-warnings`, then press\n\"Enter\". In Jupyter notebook (depending on version), choose View > Right\nSidebar > Show Notebook Tools, then under \"Common Tools\" add a tag with text\n`ignore-warnings`.\n\n### Add extra code checks to your notebook\n\nOur CI checks notebooks run from start to finish without errors or warnings.\nYou can add extra checks in notebooks to catch other unexpected behavior.\n\nFor example, say we claim a cell always returns the string `0011`. It would be\nembarassing if this was not true. We can assert this in CI by adding the\nfollowing code cell, and hide it from users with a `remove-cell` tag.\n\n```python\n# Confirm output is what we expect.\nassert _ == '0011'\n```\n\nIn Jupyter notebooks, the underscore `_` variable stores the value of the\nprevious cell output. You should also add a comment like\n`# Confirm output is what we expect` so that authors know this\nblock is only for testing. Make sure you add the tag `remove-cell`.\nIf something ever causes this value to\nchange, CI will alert us.\n\n## Format README and TypeScript files\n\nRun `npm run fmt` to automatically format the README, `.github` folder, and `scripts/` folder. You should run this command if you get the error in CI `run Prettier to fix`.\n\nTo check that formatting is valid without actually making changes, run `npm run check:fmt`.\n\n## Regenerate an existing API docs version\n\nThis is useful when we make improvements to the API generation script.\n\nYou can regenerate all API docs versions following these steps:\n\n1. Create a dedicated branch for the regeneration other than `main` using `git checkout -b <branch-name>`.\n2. Ensure there are no pending changes by running `git status` and creating a new commit for them if necessary.\n3. Run `npm run regen-apis` to regenerate all API docs versions for `qiskit`, `qiskit-ibm-runtime`, and `qiskit-ibm-transpiler`.\n\nEach regenerated version will be saved as a distinct commit. If the changes are too large for one single PR, consider splitting it up into multiple PRs by using `git cherry-pick` or `git rebase -i` so each PR only has the commits it wants to target.\n\nIf you only want to regenerate the latest stable minor release of each package, then add `--current-apis-only` as an argument, and in case you only want to regenerate versions of one package, then you can use the `-p <pkg-name>` argument.\n\nAlternatively, you can also regenerate one specific version:\n\n1. Choose which documentation you want to generate (`qiskit`, `qiskit-ibm-runtime`, or `qiskit-ibm-transpiler`) and its version.\n2. Run `npm run gen-api -- -p <pkg-name> -v <version>`,\n   e.g., `npm run gen-api -- -p qiskit -v 0.45.0`\n\nIf the version is not for the latest stable minor release series, then add `--historical` to the arguments. For example, use `--historical` if the latest stable release is 0.45.\\* but you're generating docs for the patch release 0.44.3.\n\nAdditionally, If you are regenerating a dev version, then you can add `--dev` as an argument and the documentation will be built at `/docs/api/<pkg-name>/dev`. For dev versions, end the `--version` in `-dev`, e.g. `-v 1.0.0-dev`. If a release candidate has already been released, use `-v 1.0.0rc1`, for example.\n\nIn this case, no commit will be automatically created.\n\n## Generate new API docs\n\nThis is useful when new docs content is published, usually corresponding to new releases or hotfixes for content issues. If you're generating a patch release, also see the below subsection for additional steps.\n\n1. Choose which documentation you want to generate (e.g. `qiskit` or `qiskit-ibm-runtime`) and its version.\n2. Determine the full version, such as by looking at https://github.com/Qiskit/qiskit/releases\n3. Download a CI artifact with the project's documentation. To find this:\n   1. Pull up the CI runs for the stable commit that you want to build docs from. This should not be from a Pull Request\n   2. Open up the \"Details\" for the relevant workflow.\n      - Qiskit: \"Documentation / Build (push)\"\n      - Runtime: \"CI / Build documentation (push)\"\n   3. Click the \"Summary\" page at the top of the left navbar.\n   4. Scroll down to \"Artifacts\" and look for the artifact related to documentation, such as `html_docs`.\n   5. Download the artifact by clicking on its name.\n4. Rename the downloaded zip file with its version number, e.g. `0.45.zip` for an artifact from `qiskit v0.45.2`.\n5. Upload the renamed zip file to https://ibm.ent.box.com/folder/246867452622\n6. Share the file by clicking the `Copy shared link` button\n7. Select `People with the link` and go to `Link Settings`.\n8. Under `Link Expiration` select `Disable Shared Link on` and set an expiration date of ~10 years into the future.\n9. Copy the direct link at the end of the `Shared Link Settings` tab.\n10. Modify the `scripts/config/api-html-artifacts.json` file, adding the new versions with the direct link from step 9.\n11. Run `npm run gen-api -- -p <pkg-name> -v <version>`, e.g. `npm run gen-api -- -p qiskit -v 0.45.0`. If it is not the latest minor version, set `--historical`.\n\nFor dev docs, add `--dev` and either use a version like `-v 1.0.0-dev` or `-v 1.0.0rc1`.\n\n### Setting up a new minor version\n\nFor example, the latest unversioned docs were `0.2.0` but `0.3.0` was just released.\n\nYou must first save the latest unversioned docs as historical docs by running `npm run gen-api` with the `--historical` arg. For example, first run `npm run gen-api -- -p qiskit -v 0.2.0 --historical`.\n\nOnce the historical docs are set up, you can now generate the newest docs by following the normal process, such as `npm run gen-api -- -p qiskit -v 0.3.0`.\n\n### Generate patch releases\n\nFor example, if the current docs are for 0.45.2 but you want to generate 0.45.3.\n\nWhen uploading the artifact to Box, overwrite the existing file with the new one. No need to update the file metadata.\n\nIf the version is not for the latest stable minor release series, remember to add `--historical` to the arguments. For example, use `--historical` if the latest stable release is 0.3.\\* but you're generating docs for the patch release 0.2.1.\n\n### View diff for `objects.inv`\n\nSince `objects.inv` is compressed, we can't review changes through `git diff`. Git _does_ tell you if the file has changed, but this isn't that helpful as the compressed file can be different even if the uncompressed contents are the same.\nIf you want to see the diff for the uncompressed contents, first install [`sphobjinv`](https://github.com/bskinn/sphobjinv).\n\n```sh\npipx install sphobjinv\n```\n\nThe add the following to your `.gitconfig` (usually found at `~/.gitconfig`).\n\n```\n[diff \"objects_inv\"]\n  textconv = sh -c 'sphobjinv convert plain \"$0\" -'\n```\n\n## Dependabot - upgrade notebook testing version\n\nWhen a new version of an API is released, we should also update `nb-tester/requirements.txt` to ensure that our notebooks still work with the latest version of the API. You can do this upgrade either manually or wait for Dependabot's automated PR.\n\nDependabot will fail to run at first due to not having access to the token. To fix this, have someone with write access trigger CI for the PR, such as by merging main or closing then reopening the issue.\n\nYou can land the API generation separately from the `requirements.txt` version upgrade. It's high priority to get out new versions of the API docs ASAP, so you should not block that on the notebook version upgrade if you run into any complications like failing notebooks.\n\n## Deploy guides & API docs\n\nSee the section \"Syncing content with open source repo\" in the internal docs repo's README.\n",
  "installCommand": "git clone https://github.com/Qiskit/documentation ~/.claude/skills/documentation",
  "defaultBranch": "main",
  "hasMarketplaceJson": false,
  "skillPath": "README.md"
}