{
  "id": "674a1c27e78d32e8",
  "slug": "optolith-database-schema",
  "name": "Optolith Database Schema",
  "description": "Definitions and utilities for the flat-file database of Optolith, a character creation tool for the Pen and Paper RPG “The Dark Eye 5”, and its external integrations into other software.",
  "author": "elyukai",
  "authorAvatar": "https://avatars.githubusercontent.com/u/11094577?v=4",
  "repoUrl": "https://github.com/elyukai/optolith-database-schema",
  "repoFullName": "elyukai/optolith-database-schema",
  "stars": 6,
  "forks": 4,
  "category": "other",
  "categories": [
    "other"
  ],
  "tags": [
    "dasschwarzeauge",
    "dsa",
    "tde",
    "thedarkeye"
  ],
  "tier": 3,
  "status": "active",
  "createdAt": "2022-02-15T11:41:33Z",
  "updatedAt": "2025-12-23T14:00:34Z",
  "lastCommitAt": "2025-12-23T14:00:30Z",
  "source": "github-search",
  "collectedAt": "2025-12-26T03:40:41.330Z",
  "authorUrl": "https://github.com/elyukai",
  "license": "MPL-2.0",
  "readme": "# Optolith Database Schema\n\nThis repository contains all information and logic of the Optolith flat-file database, which itself is closed source due to licensing.\n\nThe repository consists of three parts: The user documentation, the JSON Schema documents and the TypeScript definitions, checks and other logic.\n\nThe entity reference in the documentation and the JSON Schema documents are generated using a [self-written converter](https://github.com/elyukai/optolith-tsjsonschemamd) that walks the TypeScript AST and outputs them. This way, modification is only required and allowed in the TypeScript files, the other files must be generated.\n\n## Contribute\n\nIf you want to contribute, it is most likely you want to help with inserting new data into the database. In this case, the [User Documentation](docs/Home.md) is the place to start. Conversations usually happen on the [Optolith Discord Server](https://discord.gg/wfdgB9g). We can also manage required permissions there, since you can't publicly access the database, as already mentioned.\n\nIf you want to contribute to the database schema itself, please open an issue or discussion (whatever fits best) with what you want to achieve so we can discuss it. Breaking changes would require changes inside the database as well, so Pull Requests are usually not the way to go unless you want to fix a bug.\n\n## Usage\n\nIf you want to use the database (or parts of it) in your own project (most likely to support Optolith export formats in your own application), you can use the TypeScript sources as a simple database reader, at least if you have a project targeting JavaScript interpreters as well. This way, you already have proper typings. You can extract the database from the installation folder of Optolith and then configure the database reader to your needs.\n",
  "installCommand": "git clone https://github.com/elyukai/optolith-database-schema ~/.claude/skills/optolith-database-schema",
  "defaultBranch": "main",
  "hasMarketplaceJson": false,
  "skillPath": "README.md"
}