{
  "id": "e79b13e5793863ee",
  "slug": "sapphire-assistant-framework",
  "name": "Sapphire Assistant Framework",
  "description": "An extensible framework for creating Android Assistants on-device. It does not require Google services or network connectivity",
  "author": "hikari-tadashi",
  "authorAvatar": "https://avatars.githubusercontent.com/u/17326267?v=4",
  "repoUrl": "https://github.com/hikari-tadashi/Sapphire-Assistant-Framework",
  "repoFullName": "hikari-tadashi/Sapphire-Assistant-Framework",
  "stars": 323,
  "forks": 8,
  "category": "other",
  "categories": [
    "other"
  ],
  "tags": [
    "alexa",
    "android",
    "android-phones",
    "assistant",
    "foss",
    "mycroft",
    "offline",
    "sapphire-assistant-framework",
    "siri"
  ],
  "tier": 3,
  "status": "maintained",
  "createdAt": "2020-11-22T22:54:14Z",
  "updatedAt": "2025-12-03T13:12:06Z",
  "lastCommitAt": "2025-08-12T20:11:19Z",
  "source": "github-search",
  "collectedAt": "2025-12-11T09:42:45.684Z",
  "authorUrl": "https://github.com/hikari-tadashi",
  "license": "GPL-3.0",
  "readme": "# The Sapphire Assistant Framework\nThe Sapphire Assistant Framework is plug-in framework for [Athena](https://github.com/Tadashi-Hikari/Athena), an open source Google Assistant replacement (that doesn't require any Google services to run).\n\nThe Sapphire Framework is a data aggregation and processing framework for Android that allows users and developers to refine, customize, or develop a mobile assistant tailored to their needs.\n\n# Roadmap\n* Update to more modern Androids\n* Find a lightweight VAD and Hotword detector\n* Replace PocketSphinx with Whisper\n* Add in an Ollama callout\n* Wrap Llama.cpp to run small local LLMs\n* Optimize for on device NPUs\n\n# Highlights\n* Free and Open Source\n* Doesn't use Google services\n* Works on Android 7.1 to 11\n* Works entirely offline/on device\n* Highly modular and extensible\n\n# Motivation\nThe Sapphire Framework was developed to meet the needs of the open source community, while offering quality alternatives to producs in the closed source world. My original goal was simply to find a flexible mobile assistant that I could develop features for to help manage my ADHD. Finding nothing on the market to meet my need that also respected the ethics of free and open source software, I decided to start developing my own. It started out as a port of Mycroft for Android but due to system differences it quickly turned into its own project under the title \"The Sapphire Assistant Framework\". Due to concern that configuring the Sapphire Framework might overwhelm non-technical users, I split the code base in two to create [Athena](https://github.com/Tadashi-Hikari/Athena) and the Sapphire Framework, which can be installed stand alone or as a plug-in to Athena.\n\n\n# How to Build The Sapphire Framework\nIt requires both Android platform 25 and 30 in order to build, and each individual module must be built and installed separately. The project was designed this way to test running 3rd party services in the background. If you are looking for something that works out of the box or is easier to build, I recommend looking at \n[Athena](https://github.com/Tadashi-Hikari/Athena)\n\n# Build Status\nPre-Alpha \n\n# Frameworks and Libraries Used\n* CMU PocketSphinx\n* TensorSpeech TTS\n* Stanford CoreNLP\n\n# Contributions\n* Financial contributions are always appreciated, and can help me move to making this my full time job. Check out the sponsor button in the repository if you are interested in helping to fund the project\n* Join in the community on [Reddit](www.reddit.com/r/SapphireFramework) or Matrix at #SapphireFramework:matrix.org\n* Android, Machine Learning developers, and UI/UX developers would be greatly appreciated for the project (or consulting at a minimum). I will continue to move forward reguardless, but it will go a lot quicker with some domain specific expertise\n* Documentation help would be greatly appreciated. I generally have all of the information locked up in my head and I am working on documentation, but sometimes I miss what others would find helpful or need more information on. Feel free to ask questions on Reddit or Matrix (I'm pretty responsive) if you would like to help out\n",
  "installCommand": "git clone https://github.com/hikari-tadashi/Sapphire-Assistant-Framework ~/.claude/skills/sapphire-assistant-framework",
  "defaultBranch": "development",
  "hasMarketplaceJson": false,
  "skillPath": "README.md"
}